[
	{
		"title": "chicken fry",
		"exerpt": "Ingredients:250 grams cubed boneless chicken,1 - 1.5 tsp fresh ginger garlic paste,½ tsp red chilli powder,½ tsp black pepper powder,¼ tsp turmeric powder,1 tsp coriander powder,1 - 2 tsp lime juice, Salt to taste,Oil for deep frying",
		"content": "Process:Clean the chicken pieces and place in a bowl.Add all the spices, ginger garlic paste, salt, and lime juice to this,Mix well until the chicken pieces are well coated. You can also mix the marinade ingredients first in the bowl and then add the chicken pieces and mix together.Cover and refrigerate for a few hours. You can also fry immediately if short on time.Heat oil for deep frying and gently add the chicken pieces to it without overcrowding them.Fry on medium heat stirring occasionally until the chicken pieces are golden brownTake out one piece and test to see if the pieces are fully cooked.When done, drain and place on kitchen towels for the excess oil to get absorbed.Proceed with the remaining pieces until all doneServe hot with rice, any curry, and a simple salad. It's best to consume chicken fry on the same day you prepare them"
	}, {
		"title": "Hyderabadi Vegetable Dum Biryani",
		"exerpt": "1 cup basmati rice, soaked for 30 minutes,½ cup ghee (to use as needed),1 cup sliced onions,2 cups cauliflower florets (about 15 florets),2 cups beans, chopped (about 10 beans),2 cups carrot, chopped (1 medium-sized carrot), ½ cup green capsicum, chopped,¼ cup cashew nuts,3 tbsp raisins ,½ cup plain curd (yogurt),½ tsp coriander powder,¼ tsp cumin powder,1 tsp Kashmiri chilli powder,¼ tsp turmeric powder ,½ cup chopped mint leaves,½ cup chopped coriander leaves (cilantro),3 tbsp warm milk,A pinch saffron",
		"content": "Process:Wash and soak 1 cup basmati rice in enough water to completely cover it for 30 minutes.In the meantime, chop your vegetables and onion, powder the spice masala and then the ginger-garlic-onion paste in the same grinder.Soak a pinch of saffron in 3 tbsp warm milk and set aside.Heat ¼ cup ghee in a heavy-bottomed pan with a tight-fitting lid. This is the same pan we will use to cook the dum biryani.Add the sliced onions and keep flame at medium-low. Stir frequently to ensure even frying .While the onions are frying, keep water in a large pot for cooking the rice.Bring the water to a rolling boil and add 1 tsp caraway seeds (shahjeera), 2 bay leaves, 1 tsp oil, and some salt.Add the soaked rice to this and cook on medium-high heat until the rice is ¾ cooked. When you take out one grain and bite into it, it shouldn't be soft and cooked fully.While the rice is cooking, keep an eye on the onions and drain when they are fully dark brown.In the same ghee, fry the cashew nuts, drain and then fry the raisins and drain.The rice should now be done. It took me about 10 minutes to get to the right stage. Drain the rice in a colander and fluff it with a fork.Now, in the same pan used for frying the onions, top up the remaining ¼ cup ghee (see notes).Add the ginger-garlic-chilli paste and fry for a minute until fragrant.Then add the coriander powder, chilli powder, turmeric, and cumin powder.Fry for another 30 seconds taking care not to burn the masala powders.Now add the freshly ground whole spices spices or biryani masala. I added about 2 tbsp of it.Fry for 30 seconds.Lower heat to a simmer and add the curd.Mix well and immediately add the cut vegetables.Mix again to combine.Add 1 tbsp each of chopped coriander leaves and mint leaves on top.Mix again and cook covered on low flame. There's no need to add any water but you can if you feel the vegetables are burning. If you keep flame low and cook covered, the vegetables will let out enough water to cook itself in.Once the vegetables are almost cooked (took me about 5-7 mins), turn off the heat.Now we can start layering the different parts of the biryani now.Remove half of the cooked vegetable mixture to a plate .Layer half the cooked rice over this and top up with some fried onion, cashew nuts, raisins, coriander leaves, and mint leaves .Add the second layer of vegetables and repeat the rice, fried onion, cashew nuts, raisins, and coriander plus mint leaves"
	}, {
		"title": "Gongura Pappu",
		"exerpt": "4 cups chopped gongura leaves,1/2 cup toor dal, soaked for atleast an hour,1 chopped onion,A pinch of turmeric,2 tsp oil,1/2 tsp channa dal / kadala paruppu,1/2 tsp urad dal / ulutham paruppu,1/4 tsp mustard seeds,1/2 tsp jeera / cumin seeds,A few curry leaves,A generous pinch of hing / asafoetida,1 tbsp oil",
		"content": "Process:Heat 2 tsp oil and add onions and slit green chillies. Fry until transparent and pink – 2 to 3 mins.Add the chopped gongura leaves and fry for another 3 mins. Sprinkle with salt and turmeric powder and add the soaked toor dal. Mix well and cook covered on sim for 25-30 mins. Sprinkle some water if necessary – I had to because my gongura leaves were probably not super fresh. Otherwise, the water from the leaves should be sufficient, as Indira points out.Once the toor dal is cooked soft yet holds its shape, remove from fire. Heat oil for tadka and add the mustard seeds and jeera first. When the seeds pop, add the dals. Once they are golden brown, add the curry leaves and hing and mix well.Add the dal mixture to this combine well. Adjust salt."
	}
]